cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32PG1B200F256IM32.svd
        <register>
          <name>HFXOCTRL1</name>
          <description>HFXO Control 1</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000240</resetValue>
          <resetMask>0x00000277</resetMask>
          <fields>
            <field>
              <name>PEAKDETTHR</name>
              <description>Sets the Peak Detector amplitude detection threshold levels</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGLVL</name>
              <description>Reserved for internal use. Do not change.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTIBIASEN</name>
              <description>Reserved for internal use. Do not change.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFXOSTARTUPCTRL</name>
          <description>HFXO Startup Control</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA1250060</resetValue>
          <resetMask>0xFFEFF87F</resetMask>
          <fields>
            <field>
              <name>IBTRIMXOCORE</name>
              <description>Sets the Startup Oscillator Core Bias Current</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE</name>
              <description>Sets Oscillator Tuning Capacitance</description>
              <bitOffset>11</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>This Field is Reserved. It Should Be Set to 0x9</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>Sets the Regulator Output Current Level (shunt Regulator)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFXOSTEADYSTATECTRL</name>
          <description>HFXO Steady State Control</description>
          <addressOffset>0x030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA30AAD09</resetValue>
          <resetMask>0xF70FFFFF</resetMask>
          <fields>
            <field>
              <name>IBTRIMXOCORE</name>
              <description>Sets the Steady State Oscillator Core Bias Current.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGISH</name>
              <description>Sets the Steady State Regulator Output Current Level (shunt Regulator)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE</name>
              <description>Sets Oscillator Tuning Capacitance</description>
              <bitOffset>11</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGSELILOW</name>
              <description>Controls Regulator Minimum Shunt Current Detection Relative to Nominal</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEAKDETEN</name>
              <description>Enables Oscillator Peak Detectors</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGISHUPPER</name>
              <description>Set Regulator Output Current Level (shunt Regulator). Ish = 120uA + REGISHUPPER X 120uA</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFXOTIMEOUTCTRL</name>
          <description>HFXO Timeout Control</description>
          <addressOffset>0x034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00026667</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>STARTUPTIMEOUT</name>
              <description>Wait Duration in HFXO Startup Enable Wait State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2CYCLES</name>
                  <description>Timeout period of 2 cycles</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4CYCLES</name>
                  <description>Timeout period of 4 cycles</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CYCLES</name>
                  <description>Timeout period of 16 cycles</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CYCLES</name>
                  <description>Timeout period of 32 cycles</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CYCLES</name>
                  <description>Timeout period of 256 cycles</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCYCLES</name>
                  <description>Timeout period of 1024 cycles</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCYCLES</name>
                  <description>Timeout period of 2048 cycles</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCYCLES</name>
                  <description>Timeout period of 4096 cycles</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCYCLES</name>
                  <description>Timeout period of 8192 cycles</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16KCYCLES</name>
                  <description>Timeout period of 16384 cycles</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KCYCLES</name>
                  <description>Timeout period of 32768 cycles</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STEADYTIMEOUT</name>
              <description>Wait Duration in HFXO Startup Steady Wait State</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2CYCLES</name>
                  <description>Timeout period of 2 cycles</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4CYCLES</name>
                  <description>Timeout period of 4 cycles</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CYCLES</name>
                  <description>Timeout period of 16 cycles</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CYCLES</name>
                  <description>Timeout period of 32 cycles</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CYCLES</name>
                  <description>Timeout period of 256 cycles</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCYCLES</name>
                  <description>Timeout period of 1024 cycles</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCYCLES</name>
                  <description>Timeout period of 2048 cycles</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCYCLES</name>
                  <description>Timeout period of 4096 cycles</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCYCLES</name>
                  <description>Timeout period of 8192 cycles</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16KCYCLES</name>
                  <description>Timeout period of 16384 cycles</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KCYCLES</name>
                  <description>Timeout period of 32768 cycles</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>Wait Duration in HFXO Warm Startup Steady Wait State</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEAKDETTIMEOUT</name>
              <description>Wait Duration in HFXO Peak Detection Wait State</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2CYCLES</name>
                  <description>Timeout period of 2 cycles</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4CYCLES</name>
                  <description>Timeout period of 4 cycles</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CYCLES</name>
                  <description>Timeout period of 16 cycles</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CYCLES</name>
                  <description>Timeout period of 32 cycles</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CYCLES</name>
                  <description>Timeout period of 256 cycles</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCYCLES</name>
                  <description>Timeout period of 1024 cycles</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCYCLES</name>
                  <description>Timeout period of 2048 cycles</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCYCLES</name>
                  <description>Timeout period of 4096 cycles</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCYCLES</name>
                  <description>Timeout period of 8192 cycles</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16KCYCLES</name>
                  <description>Timeout period of 16384 cycles</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KCYCLES</name>
                  <description>Timeout period of 32768 cycles</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHUNTOPTTIMEOUT</name>
              <description>Wait Duration in HFXO Shunt Current Optimization Wait State</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2CYCLES</name>
                  <description>Timeout period of 2 cycles</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4CYCLES</name>
                  <description>Timeout period of 4 cycles</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CYCLES</name>
                  <description>Timeout period of 16 cycles</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CYCLES</name>
                  <description>Timeout period of 32 cycles</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CYCLES</name>
                  <description>Timeout period of 256 cycles</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCYCLES</name>
                  <description>Timeout period of 1024 cycles</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCYCLES</name>
                  <description>Timeout period of 2048 cycles</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCYCLES</name>
                  <description>Timeout period of 4096 cycles</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCYCLES</name>
                  <description>Timeout period of 8192 cycles</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16KCYCLES</name>
                  <description>Timeout period of 16384 cycles</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KCYCLES</name>
                  <description>Timeout period of 32768 cycles</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LFXOCTRL</name>
          <description>LFXO Control Register</description>
          <addressOffset>0x038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x07009000</resetValue>
          <resetMask>0x0713DB7F</resetMask>
          <fields>
            <field>
              <name>TUNING</name>
              <description>LFXO Internal Capacitor Array Tuning Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>LFXO Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL</name>
                  <description>32768 Hz crystal oscillator</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFEXTCLK</name>
                  <description>An AC coupled buffer is coupled in series with LFXTAL_N pin, suitable for external sinus wave (32768 Hz).</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGEXTCLK</name>
                  <description>Digital external clock on LFXTAL_N pin. Oscillator is effectively bypassed.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GAIN</name>
              <description>LFXO Startup Gain</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGHAMPL</name>
              <description>LFXO High XTAL Oscillation Amplitude Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC</name>
              <description>LFXO AGC Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUR</name>
              <description>LFXO Current Trim</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFCUR</name>
              <description>LFXO Buffer Bias Current</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>LFXO Timeout</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2CYCLES</name>
                  <description>Timeout period of 2 cycles</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CYCLES</name>
                  <description>Timeout period of 256 cycles</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCYCLES</name>
                  <description>Timeout period of 1024 cycles</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCYCLES</name>
                  <description>Timeout period of 2048 cycles</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCYCLES</name>
                  <description>Timeout period of 4096 cycles</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCYCLES</name>
                  <description>Timeout period of 8192 cycles</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16KCYCLES</name>
                  <description>Timeout period of 16384 cycles</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KCYCLES</name>
                  <description>Timeout period of 32768 cycles</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
